---
kind: type
id: T:Autodesk.Revit.DB.BRepBuilderSurfaceGeometry
source: html/c21d4101-cc15-1990-ee9f-994b487bf95d.htm
---
# Autodesk.Revit.DB.BRepBuilderSurfaceGeometry

An abstract class used by BRepBuilder to represent the geometry of a surface. Specific surface-geometry representations are represented by subclasses.

## Syntax (C#)
```csharp
public class BRepBuilderSurfaceGeometry : IDisposable
```